HaiIsMe/CO3010_221/Lab1/Ex5/STM32CubeIDE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define R0_Pin GPIO_PIN_1
#define R0_GPIO_Port GPIOA
#define Y0_Pin GPIO_PIN_2
#define Y0_GPIO_Port GPIOA
#define G0_Pin GPIO_PIN_3
#define G0_GPIO_Port GPIOA
#define R1_Pin GPIO_PIN_4
#define R1_GPIO_Port GPIOA
#define Y1_Pin GPIO_PIN_5
#define Y1_GPIO_Port GPIOA
#define G1_Pin GPIO_PIN_6
#define G1_GPIO_Port GPIOA
#define a0_Pin GPIO_PIN_0
#define a0_GPIO_Port GPIOB
#define b0_Pin GPIO_PIN_1
#define b0_GPIO_Port GPIOB
#define c0_Pin GPIO_PIN_2
#define c0_GPIO_Port GPIOB
#define d1_Pin GPIO_PIN_10
#define d1_GPIO_Port GPIOB
#define e1_Pin GPIO_PIN_11
#define e1_GPIO_Port GPIOB
#define f1_Pin GPIO_PIN_12
#define f1_GPIO_Port GPIOB
#define g1_Pin GPIO_PIN_13
#define g1_GPIO_Port GPIOB
#define d0_Pin GPIO_PIN_3
#define d0_GPIO_Port GPIOB
#define e0_Pin GPIO_PIN_4
#define e0_GPIO_Port GPIOB
#define f0_Pin GPIO_PIN_5
#define f0_GPIO_Port GPIOB
#define g0_Pin GPIO_PIN_6
#define g0_GPIO_Port GPIOB
#define a1_Pin GPIO_PIN_7
#define a1_GPIO_Port GPIOB
#define b1_Pin GPIO_PIN_8
#define b1_GPIO_Port GPIOB
#define c1_Pin GPIO_PIN_9
#define c1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
